Enums/бит_мпд_СпособыПоискаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_мпд_СпособыПоискаДанных</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоВнутреннимИдентификаторам</Name>
					<Comment>По внутренним идентификаторам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРеквизитам</Name>
					<Comment>По реквизитам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗначению</Name>
					<Comment>По значению</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИменам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСоответствиюИмен</Name>
					<Comment>По соответствию значений</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_мпд_СостоянияПодключенияИБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_мпд_СостоянияПодключенияИБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекущаяБаза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяБаза_Подключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяБаза_НеПодключена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_мпд_ВидыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_мпд_ВидыОбъектовМетаданных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
					<Comment>Справочники</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перечисление</Name>
					<Comment>Перечисления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
					<Comment>Документы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>ПланыСчетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>ПланыВидовХарактеристик</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/бит_мпд_ВнешниеИсточникиСервер/Ext/Module.bsl
#Область ПроцедурыИФункцииРаботыСВнешнейБазой

// Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПреобразоватьЗначениеВнешняяТекущая(Соединение
	                                          , НастройкаПодключения
											  , ЗначениеКом
											  , Список = Неопределено
											  , ПравилаПоиска
											  , КэшПоиска) Экспорт

	Если Список = Неопределено Тогда
	
		Список = Новый СписокЗначений;
	
	КонецЕсли; 
	
	МетаКом = Соединение.Метаданные;
	
	Если бит_ОбщегоНазначения.ЭтоПримитивныйТип(ЗначениеКом) Тогда
		
		РезЗначение = ЗначениеКом;	
		
	Иначе
		
		Попытка
			
			МетаЗначение = ЗначениеКом.Метаданные();
			
		Исключение
			
			МетаЗначение = Неопределено;   
			
		КонецПопытки;	
		
		Если НЕ МетаЗначение = Неопределено Тогда
			
			ИмяПолное = МетаЗначение.ПолноеИмя();
			
			Если Найти(ИмяПолное,"Перечисление.") = 0 Тогда
				
				ТекИД        = Соединение.String(ЗначениеКом.УникальныйИдентификатор());
				
			Иначе
				
				СтруктураИмен   = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ИмяПолное);
				ПеречислениеКом = Соединение.Перечисления[СтруктураИмен.ИмяОбъекта];
				ТекИД           = ПолучитьИмяЗначенияПеречисленияВнеш(Соединение, ПеречислениеКом, ЗначениеКом);
				
			КонецЕсли;			
			
			КлючЗначения = ИмяПолное+"?ref="""+ТекИД+"""";
			
			РезЗначение = КэшПоиска[КлючЗначения];
			
			Если РезЗначение = Неопределено Тогда
				
				Правило = ПравилаПоиска[ИмяПолное];
				
				СтрПар = Новый Структура("Правило,Направление,ЗначениеПоиска,ИмяОбъектаПолное");
				СтрПар.Правило          = Правило;
				СтрПар.Направление      = "ВнешняяТекущая";
				СтрПар.ЗначениеПоиска   = ЗначениеКом;
				СтрПар.ИмяОбъектаПолное = ИмяПолное;
				
				РезЗначение = ВыполнитьПоискПоПравилу(Соединение, СтрПар);
				
				КэшПоиска.Вставить(КлючЗначения, РезЗначение);
				
			КонецЕсли; 
			
			
			Если РезЗначение = Неопределено Тогда
				
				Если ОбъектПринадлежитКоллекцииМетаданных(МетаКом,"Документы",МетаЗначение.Имя) Тогда
					
					ТекПредставление = МетаЗначение.Синоним+" № "+ЗначениеКом.Номер+НСтр("ru=' от '")+ЗначениеКом.Дата;
					
				ИначеЕсли ОбъектПринадлежитКоллекцииМетаданных(МетаКом,"ПланыСчетов",МетаЗначение.Имя) Тогда
					
					ТекПредставление = ЗначениеКом.Код;
					
				Иначе
					
					ТекПредставление = Соединение.String(ЗначениеКом);
					
				КонецЕсли; 	
				
				Если ПустаяСтрока(ТекПредставление) Тогда
					
					ТекПредставление = " ";
					
				КонецЕсли; 
				
				СтрРасшифровки = Новый Структура("ИмяКласса, НастройкаПодключения, ПолноеИмя, ИД, Значение, Представление", "ЗначениеВнешнейБазы");
				СтрРасшифровки.НастройкаПодключения = НастройкаПодключения;
				СтрРасшифровки.ПолноеИмя = МетаЗначение.ПолноеИмя();
				
				Если Найти(СтрРасшифровки.ПолноеИмя,"Перечисление.") = 0 Тогда
					
					СтрРасшифровки.ИД        = Соединение.String(ЗначениеКом.УникальныйИдентификатор());
					
				КонецЕсли; 
				СтрРасшифровки.Представление = ТекПредставление;
				
				РезЗначение = СтрРасшифровки;
				
				КэшПоиска.Вставить(КлючЗначения, РезЗначение);				
				
			КонецЕсли; 
						
		КонецЕсли; // НЕ МетаЗначение = Неопределено.
		
	КонецЕсли; // Проверка типов ЗначениеКом.

	Возврат РезЗначение;
	
КонецФункции // ПреобразоватьЗначениеВнешняяТекущая()

// Функция выполняет преобразование ОписанияТипов из текущей базы во внешнюю.
//
// Параметры:
//  Соединение      - ComObject.
//  ОписаниеВнешняя - ОписаниеТипов.
//
// Возвращаемое значение:
//  ОписаниеТекущая – ОписаниеТипов.
//
Функция ПреобразоватьОписаниеТиповВнешняяТекущая(Соединение, ОписаниеВнешняя, ПравилаПоиска = Неопределено) Экспорт
	
	ОписаниеТекущая = Неопределено;
	
	МетаКореньВнешняя  = Соединение.Метаданные;
	МассивТиповВнешняя = ОписаниеВнешняя.Типы();
	МассивТиповТекущая = Новый Массив;
	
	Для каждого ТипВнешний Из МассивТиповВнешняя Цикл
		
		МетаВнешний = МетаКореньВнешняя.НайтиПоТипу(ТипВнешний);
		
		Если НЕ МетаВнешний = Неопределено Тогда
			
			// Ссылочные тип - попытаемся преобразовать.
			ИмяПолное   = МетаВнешний.ПолноеИмя();
			
			Если НЕ ПравилаПоиска = Неопределено Тогда
				
				// Если заданы правила поиска пытаемся найти в приемнике имя объекта, Соответствующее источнику.
				Правило = ПравилаПоиска[ИмяПолное];
				
				Если НЕ Правило = Неопределено Тогда
					
					
					РеквизитыПравила = ОпределитьИменаРеквизитовПравила(Правило,"ВнешняяТекущая");
					ИмяПолноеТек = Правило["ИмяОбъектаПолное_"+РеквизитыПравила.НомерПриемника];
					
					СтрИмен = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ИмяПолноеТек);
					
				Иначе
					
					СтрИмен = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ИмяПолное);				 
					
				КонецЕсли; 
				
			Иначе	
				
				СтрИмен = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ИмяПолное);
				
			КонецЕсли; 
			
			ИмяТипа = СтрИмен.ИмяКласса+"Ссылка."+СтрИмен.ИмяОбъекта;		 
			
			
		Иначе	
			
			// Примитивные тип - просто создаем.
			ИмяТипа = Соединение.String(ТипВнешний);
			
		КонецЕсли; 
		
		Попытка
			
			ТипТекущая = Тип(ИмяТипа);
			МассивТиповТекущая.Добавить(ТипТекущая);
			
		Исключение
			
		КонецПопытки;
		
	КонецЦикла; // МассивТиповВнешняя.
	
	
	Если МассивТиповТекущая.Количество() = 0 Тогда
		
		МассивТиповТекущая.Добавить(Тип("Строка"));
		
	КонецЕсли; 
	
	ОписаниеТекущая = Новый ОписаниеТипов(МассивТиповТекущая);
	
	Возврат ОписаниеТекущая;
	
КонецФункции // ПреобразоватьОписаниеТиповВнешняяТекущая()

// Функция создает границу в базе, подключенной через внешнее соединение.
//
// Параметры:
//  Соединение - ComObject.
//  ГраницаТекБаза - Граница.
//
// Возвращаемое значение:
//  Результат – Дата,ComObject.
//
Функция ГраницаВнешняяБаза(Соединение, ГраницаТекБаза)

	Если ТипЗнч(ГраницаТекБаза) = Тип("Граница") Тогда
		
		ВидГраницыВнешБаза = ВидГраницыВнешняяБаза(Соединение, ГраницаТекБаза.ВидГраницы);
		ГраницаВнешБаза    = Соединение.NewObject("Граница",ГраницаТекБаза.Значение,ВидГраницыВнешБаза);
		
	Иначе
		
		ГраницаВнешБаза = ГраницаТекБаза;
		
	КонецЕсли; 

	Возврат ГраницаВнешБаза;
	
КонецФункции // ГраницаВнешняяБаза()

// Функция создает ВидГраницы в базе, подключенной через внешнее соединение.
//
// Параметры:
//  Соединение     - ComObject.
//  ГраницаТекБаза - Граница.
//
// Возвращаемое значение:
//  ВидГраницыВнешБаза – ComObject.
//
Функция ВидГраницыВнешняяБаза(Соединение,ВидГраницыТек)
	
	Если ВидГраницыТек = ВидГраницы.Исключая Тогда
		
		ВидГраницыВнешБаза = Соединение.ВидГраницы.Исключая;
		
	Иначе	
		
		ВидГраницыВнешБаза = Соединение.ВидГраницы.Включая;
		
	КонецЕсли; 	
	
	Возврат ВидГраницыВнешБаза;
	
КонецФункции // ВидГраницыВнешняяБаза()

// Функция определяет принадлежит объект указанной коллекции метаданных или нет.
//
// Параметры:
//  МетаКорень    - ComObject.
//  ИмяКоллекции  – Строка.
//  ИмяОбъекта    - Строка.
//
// Возвращаемое значение:
//   флПринадлежит   – Булево.
//
Функция ОбъектПринадлежитКоллекцииМетаданных(МетаКорень, ИмяКоллекции, ИмяОбъекта) Экспорт

	Если МетаКорень[ИмяКоллекции].Найти(ИмяОбъекта) = НЕОПРЕДЕЛЕНО Тогда
		флПринадлежит = Ложь;
	Иначе	
		флПринадлежит = Истина;
	КонецЕсли; 
	
	Возврат флПринадлежит;

КонецФункции // ОбъектПринадлежитКоллекцииМетаданных()
 
// Функция осуществляет поиск значения во внешней ИБ по значение из текущей ИБ.
//
// Параметры:
//  Соединение        - ComObject.
//  ЗначениеДляПоиска - Произвольный.
//
// Возвращаемое значение:
//  НайденноеЗначение – Строка.
//
Функция ВыполнитьПоискВоВнешнейБазе(Соединение, ПравилаПоиска, ЗначениеДляПоиска, ВыводитьСообщения = Ложь)  Экспорт

	НайденноеЗначение = Неопределено;
	
	// Проверим является значение для поиска ссылочным, в противном случае поиск выполнять не нужно.
	Если бит_ОбщегоНазначения.ЭтоПримитивныйТип(ЗначениеДляПоиска) Тогда
		
		НайденноеЗначение = ЗначениеДляПоиска;
		
	ИначеЕсли ТипЗнч(ЗначениеДляПоиска) = Тип("Граница") Тогда	
		
		НайденноеЗначение = ГраницаВнешняяБаза(Соединение,ЗначениеДляПоиска);
		
	ИначеЕсли ТипЗнч(ЗначениеДляПоиска) = Тип("СписокЗначений") Тогда
		
		НайденноеЗначение = Соединение.NewObject("СписокЗначений");
		Для каждого Элемент Из ЗначениеДляПоиска Цикл
		
			КонвЗначение = ВыполнитьПоискВоВнешнейБазе(Соединение, ПравилаПоиска, Элемент.Значение);
			
			НайденноеЗначение.Добавить(КонвЗначение, Элемент.Представление, Элемент.Пометка);
		
		КонецЦикла; 
		
	Иначе	
		
		МетаОбъект = ЗначениеДляПоиска.Метаданные();
		ИмяПолное  = МетаОбъект.ПолноеИмя();
		
		Правило = ПравилаПоиска[ИмяПолное];
		
		СтрПар = Новый Структура("Правило,Направление,ЗначениеПоиска,ИмяОбъектаПолное");
		СтрПар.Правило          = Правило;
		СтрПар.Направление      = "ТекущаяВнешняя";
		СтрПар.ЗначениеПоиска   = ЗначениеДляПоиска;
		СтрПар.ИмяОбъектаПолное = ИмяПолное;
		
		НайденноеЗначение = ВыполнитьПоискПоПравилу(Соединение, СтрПар);
		
	КонецЕсли; 

	Если ВыводитьСообщения Тогда
		
		Если ЗначениеЗаполнено(ЗначениеДляПоиска) И НайденноеЗначение = Неопределено Тогда
			
			Если ЗначениеЗаполнено(ИмяПолное) Тогда
				
				ИмяТипа = "("+ИмяПолное+")"
				
			Иначе	
				
				ИмяТипа = "";
				
			КонецЕсли;
			ТекстСообщения = НСтр("ru = 'Не удалось найти значение ""%1"" %2 во внешней базе!'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(ЗначениеДляПоиска), ИмяТипа);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат НайденноеЗначение;
	
КонецФункции // ВыполнитьПоискВнешняяБаза()

// Функция выполняет поиск значения по правилу в базе, подключенной через внешнее соединение.
//
// Параметры:
//  Соединение - ComObject.
//  Правило    - СправочникСсылка.бит_мпд_ПравилаПоискаДанных.
//
// Возвращаемое значение:
//  НайденноеЗначение – Произвольный.
//
Функция ВыполнитьПоискПоПравилу(Соединение, СтруктураПараметров, РежимСообщений = "Ошибки")  Экспорт

	РежимыВывода = бит_ОбщегоНазначения.ОпределитьРежимыВывода(РежимСообщений);
	
	Правило = СтруктураПараметров.Правило;
	
	ЗначениеПоиска   = СтруктураПараметров.ЗначениеПоиска;
	Направление      = СтруктураПараметров.Направление;
	
	НайденноеЗначение = Неопределено;
	
	Если ЗначениеЗаполнено(Правило) Тогда
		
		НомерИсточника = ОпределитьНомерРеквизитаИсточника(Правило,СтруктураПараметров.Направление);
		НомерПриемника = ОпределитьНомерРеквизитаПриемника(НомерИсточника);
		ИмяОбъектаПолное = Правило["ИмяОбъектаПолное_"+НомерПриемника];
		
		// Выполним поиск значения по правилам.
		ТаблицаПравила = Правило.ПравилаПоиска.Выгрузить();
		
		ТаблицаВрем = ТаблицаПравила.Скопировать();
		ТаблицаВрем.Свернуть("Приоритет");
		ТаблицаВрем.Сортировать("Приоритет");
		МассивПриоритет = ТаблицаВрем.ВыгрузитьКолонку("Приоритет");
		
		Для каждого Приоритет Из МассивПриоритет Цикл
			
			СтрОтбор = Новый Структура("Приоритет",Приоритет);
			
			СтрокиПравил = ТаблицаПравила.НайтиСтроки(СтрОтбор);
			
			Если СтрокиПравил.Количество() > 0 Тогда
			
				 ПерваяСтрока = СтрокиПравил[0];
				 
				 СтруктураИмен = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ИмяОбъектаПолное);
				 
				 Если ПерваяСтрока.СпособПоискаДанных = Перечисления.бит_мпд_СпособыПоискаДанных.ПоВнутреннимИдентификаторам Тогда
					 
					// Поиск по внутреннему идентификатору. 
					НайденноеЗначение = бит_мпд_КлиентСервер.НайтиПоИД(Соединение, СтруктураПараметров, СтруктураИмен, "ПоСсылке", РежимыВывода.ВыводитьОшибки);
					
				 ИначеЕсли ПерваяСтрока.СпособПоискаДанных = Перечисления.бит_мпд_СпособыПоискаДанных.ПоИменам Тогда
					 
					// Поиск по именам для перечислений и предопределенных элементов справочников.
					НайденноеЗначение = НайтиПоИмени(Соединение, СтруктураПараметров, СтруктураИмен, "ПоИмени", РежимыВывода.ВыводитьОшибки);
					
				 ИначеЕсли ПерваяСтрока.СпособПоискаДанных = Перечисления.бит_мпд_СпособыПоискаДанных.ПоСоответствиюИмен Тогда
					 
					// Поиск по именам для перечислений и предопределенных элементов справочников.
					НайденноеЗначение = НайтиПоИмени(Соединение, СтруктураПараметров, СтруктураИмен, "ПоСоответствию", РежимыВывода.ВыводитьОшибки);
					
				 Иначе	
					 
					// Поиск по реквизитам и условиям. 
					НайденноеЗначение = НайтиПоУсловию(Соединение, СтруктураПараметров, СтрокиПравил, РежимыВывода.ВыводитьОшибки);
					  
				 КонецЕсли; 
				 
				 Если НЕ НайденноеЗначение = Неопределено Тогда
				 
				 	 Прервать;
				 
				 КонецЕсли; 
				 
			КонецЕсли; 
						
		КонецЦикла; // МассивПриоритет.
		
	КонецЕсли; // ЗначениеЗаполнено(Правило)
	
	
	Возврат НайденноеЗначение;
	
КонецФункции // ВыполнитьПоискПоПравилу()

// Функция выполняет поиск значения во внешней базе по имени.
//
// Параметры:
//  Соединение          - ComObject.
//  СтруктураПараметров - Структура.
//  СтруктураИмен       - Структура.
//  Режим               - Строка.
//  ВыводитьОшибки      - Булево.
//
// Возвращаемое значение:
//  НайденноеЗначение – Произвольный.
//
Функция НайтиПоИмени(Соединение, СтруктураПараметров, СтруктураИмен, Режим, ВыводитьОшибки = Ложь) Экспорт

	НайденноеЗначение = Неопределено;
	
	Правило          = СтруктураПараметров.Правило;
	ИмяОбъектаПолное = СтруктураПараметров.ИмяОбъектаПолное;
	ЗначениеПоиска   = СтруктураПараметров.ЗначениеПоиска;
	Направление      = СтруктураПараметров.Направление;	
	
	флПриемникВнешняя = ?(ВРег(Направление) = ВРег("ТекущаяВнешняя"),Истина,Ложь);
	
	РеквизитыПравила = ОпределитьИменаРеквизитовПравила(Правило,Направление);
	
	Если СтруктураИмен.ИмяКоллекции = "Перечисления" Тогда
		
		Если флПриемникВнешняя Тогда
			ИмяЗначения = бит_ОбщегоНазначения.ПолучитьИмяЗначенияПеречисления(Перечисления[СтруктураИмен.ИмяОбъекта],ЗначениеПоиска);		
		Иначе	
			ИмяЗначения = ПолучитьИмяЗначенияПеречисленияВнеш(Соединение,Соединение.Перечисления[СтруктураИмен.ИмяОбъекта],ЗначениеПоиска); 
		КонецЕсли; 
		ИмяПеречисленияПоиск = Правило["ИмяОбъектаПолное_"+РеквизитыПравила.НомерПриемника];
		
		
		// Определим имя перечисления в приемнике.
		Если ВРег(Режим) = ВРег("ПоИмени") Тогда
			
			// Имена совпадают в приемнике и источнике.
			ИмяЗначенияВнеш = ИмяЗначения;
			
		ИначеЕсли ВРег(Режим) = ВРег("ПоСоответствию") Тогда	
			
			Имена = Новый Соответствие;
			
			ИмяКолонкиИсточник = "ИмяЗначения_"+РеквизитыПравила.НомерИсточника;
			ИмяКолонкиПриемник = "ИмяЗначения_"+РеквизитыПравила.НомерПриемника;			
			
			Для каждого СтрокаТаблицы Из Правило.СоответствиеИмен Цикл
				
				Имена.Вставить(СтрокаТаблицы[ИмяКолонкиИсточник],СтрокаТаблицы[ИмяКолонкиПриемник]);
				
			КонецЦикла; // Правило. СоответствиеИмен.
			
			ИмяЗначенияВнеш = Имена[ИмяЗначения];
			
		КонецЕсли; 
		
		Если НЕ ИмяЗначенияВнеш = Неопределено Тогда
			
			СтруктураИменВнеш = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ИмяПеречисленияПоиск);
			
			Попытка
				
				Если флПриемникВнешняя Тогда
					
					ПеречислениеПоиск   = Соединение.Перечисления[СтруктураИменВнеш.ИмяОбъекта];
					
				Иначе	
					
					ПеречислениеПоиск   = Перечисления[СтруктураИменВнеш.ИмяОбъекта];
					
				КонецЕсли; 
				
				НайденноеЗначение = ПеречислениеПоиск[ИмяЗначенияВнеш];				
				
			Исключение
				
				Если ВыводитьОшибки Тогда
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					ТекстСообщения = НСтр("ru = 'Ошибка поиска объекта ""%1%"" по имени ""%2%""!
												|%3.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяОбъектаПолное, ИмяЗначенияВнеш, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли; 
				
			КонецПопытки; 
			
		КонецЕсли; // НЕ ИмяПеречисленияВнеш = Неопределено.
		
		
	ИначеЕсли СтруктураИмен.ИмяКоллекции = "Справочники" Тогда	
		
		
		
	КонецЕсли; 

	Возврат НайденноеЗначение;
	
КонецФункции // НайтиПоИмени()

// Функция осуществляет поиск по объектов во внешней базе по Реквизитам и Значениям.
//
// Параметры:
//  Соединение - ComObject.
//  СтруктураПараметров - Структура.
//  СтрокиПравил        - Массив.
//  ВыводитьОшибки      - Булево.
//
// Возвращаемое значение:
//  НайденноеЗначение – Произвольный.
//
Функция НайтиПоУсловию(Соединение, СтруктураПараметров, СтрокиПравил, ВыводитьОшибки)
	
	Правило = СтруктураПараметров.Правило;
	НомерИсточника = ОпределитьНомерРеквизитаИсточника(Правило,СтруктураПараметров.Направление);
	НомерПриемника = ОпределитьНомерРеквизитаПриемника(НомерИсточника);
	ИмяОбъектаПолное = Правило["ИмяОбъектаПолное_"+НомерПриемника];
	ЗначениеПоиска   = СтруктураПараметров.ЗначениеПоиска;
	Направление      = СтруктураПараметров.Направление;	
	
	НайденноеЗначение = Неопределено;
	
	// Поиск по реквизитам и значениям.
	РеквизитыПравила = ОпределитьИменаРеквизитовПравила(Правило, Направление);
	
	Если ВРег(СтруктураПараметров.Направление) = ВРег("ВнешняяТекущая") Тогда
		
		Запрос = Новый Запрос;
		
	ИначеЕсли ВРег(СтруктураПараметров.Направление) = ВРег("ТекущаяВнешняя") Тогда
		
		Запрос = Соединение.NewObject("Запрос");
		
	КонецЕсли; 
	
	// Шаблон текста запроса для поиска.
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаПоиска.Ссылка
	|ИЗ
	|	"+ИмяОбъектаПолное+" КАК ТаблицаПоиска
	|ГДЕ
	|	%Условия%";
	
	ТекстУсловия = "";				
	
	// Сформируем текст условия для запроса по строка ПравилаПоиска и установим параметры запроса.
	Значение = 1;				
	Для каждого стрПравило Из СтрокиПравил  Цикл
		
		ИмяПараметра = "Параметр_" + Значение;
		
		Если стрПравило.СпособПоискаДанных = Перечисления.бит_мпд_СпособыПоискаДанных.ПоЗначению Тогда
			
			ЗначениеПараметра = стрПравило.ЗначениеПоиска;
			
		Иначе
			
			// Получим значение реквизита источника.
			ИмяРеквизитаИсточника = стрПравило[РеквизитыПравила.ИмяИсточника];  			
			Попытка
				
				ЗначениеПараметра = ЗначениеПоиска[ИмяРеквизитаИсточника];
				
			Исключение
				
				
				Если ВыводитьОшибки Тогда
					ТекстСообщения = НСтр("ru = 'Не удалось получить значение реквизита ""%1"" объекта ""%2""!'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяРеквизитаИсточника, ИмяОбъектаПолное);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			    КонецЕсли; 
			
				ЗначениеПараметра = Неопределено;  
				
			КонецПопытки;
			
		КонецЕсли; 
		
		Запрос.УстановитьПараметр(ИмяПараметра,ЗначениеПараметра);
		
		ИмяРеквизитаПриемника = стрПравило[РеквизитыПравила.ИмяПриемника];  					   
		ТекстУсловия = ТекстУсловия
						+?(ПустаяСтрока(ТекстУсловия),"",Символы.ПС+" И ")
						+"ТаблицаПоиска."
						+ИмяРеквизитаПриемника
						+" = &"
						+ИмяПараметра;
		
		Значение = Значение+1;
	КонецЦикла; //СтрокиПравил				
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%Условия%",ТекстУсловия);
	
	Запрос.Текст = ТекстЗапроса;
	
	Попытка
		
		Результат = Запрос.Выполнить();
		
	Исключение
		
		
		Если ВыводитьОшибки Тогда
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = НСтр("ru = 'Ошибка поиска объекта ""%1""! Способ поиска ""%2"".
										|%3.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяОбъектаПолное, стрПравило.СпособПоискаДанных, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
		
		
		Результат = Неопределено;
		
	КонецПопытки;
	
	Если НЕ Результат = Неопределено Тогда
		
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			НайденноеЗначение = Выборка.Ссылка;
		КонецЕсли; 
		
	КонецЕсли; 
	
	
	Возврат НайденноеЗначение;
	
КонецФункции // НайтиПоУсловию()

// Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ОпределитьИменаРеквизитовПравила(Правило,Направление)

	Имена = Новый Структура("ИмяИсточника,ИмяПриемника,НомерИсточника,НомерПриемника");
	
	НомерИсточника = ОпределитьНомерРеквизитаИсточника(Правило,Направление);
	НомерПриемника = ОпределитьНомерРеквизитаПриемника(НомерИсточника);
	Имена.ИмяИсточника = "ИмяРеквизита_"+Формат(НомерИсточника, "ЧГ=");
	Имена.ИмяПриемника = "ИмяРеквизита_"+Формат(НомерПриемника, "ЧГ=");
	Имена.НомерИсточника = Формат(НомерИсточника, "ЧГ=");
	Имена.НомерПриемника = Формат(НомерПриемника, "ЧГ=");
	
	Возврат Имена;
	
КонецФункции // ОпределитьИменаРеквизитовПриемникИсточник()

// Функция определяет номер реквизита приемника в правиле поиска данных в зависимости от направления обмена.
//
// Параметры:
//  Правило - СправочникСсылка.бит_мпд_ПравилаПоискаДанных.
//  Направление - Строка - "ТекущаяВнешняя", "ВнешняяТекущая".
//
// Возвращаемое значение:
//  НомерРеквизита – Число.
//
Функция ОпределитьНомерРеквизитаИсточника(Правило,Направление)

	Если ВРег(Направление) = ВРег("ТекущаяВнешняя") Тогда
		
		НомерРеквизита = 1;
		
	Иначе
		
		НомерРеквизита = 2;
		
	КонецЕсли; 
	
	Возврат НомерРеквизита;
	
КонецФункции // ОпределитьНомерРеквизитаПравила()

// Функция вычисляет номер реквизита источника в правиле поиска в зависимости от НомераРеквизитаИсточника.
//
// Параметры:
//  НомерРеквизитаИсточника - Число.
//
// Возвращаемое значение:
//  НомерРеквизита – Число.
//
Функция ОпределитьНомерРеквизитаПриемника(НомерРеквизитаИсточника)
	
	НомерРеквизита = 3-НомерРеквизитаИсточника;
	
	Возврат НомерРеквизита;
	
КонецФункции // ОпределитьНомерРеквизитаПриемника()

// Функция определяет является ли текущий вид информационной базы внешним.
//
// Параметры:
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ЭтоВнешняяБаза(ВидИнформационнойБазы) Экспорт
	
	флЭтоВнешняяБаза = Ложь;
	
	Возврат флЭтоВнешняяБаза;
	
КонецФункции // ЭтоВнешняяБаза()

// Процедура подключается к внешней базе.
//
// Параметры:
//  СостояниеПодключения 	- ПеречислениеСсылка.бит_мпд_СостоянияПодключенияИБ.
//  ТипСоединения 			- Строка.
//  ТекстОшибки 			- Строка.
// 
// Возвращаемое значение:
//  СОМОбъект ИЛИ Неопределено.
//
Функция ПолучитьСоединениеИБ(СостояниеПодключения, ВидТекущейИБ, ВидПодключеннойИБ, ТипСоединения, АдресКомОбъекта = Неопределено, ТекстОшибки = Неопределено) Экспорт
	
	флЭтоВнешняяБаза = ЭтоВнешняяБаза(ВидТекущейИБ);
	Если ТекстОшибки = Неопределено Тогда
		ТекстОшибки = "";
	КонецЕсли;
	
	ПеречСостоянияПодключения = Перечисления.бит_мпд_СостоянияПодключенияИБ;
	
	Если флЭтоВнешняяБаза Тогда
		
		Если СостояниеПодключения = ПеречСостоянияПодключения.ВнешняяБаза_Подключена И ЗначениеЗаполнено(АдресКомОбъекта) Тогда
			
			СоединениеИБ = ПолучитьИзВременногоХранилища(АдресКомОбъекта);
			Если СоединениеИБ = Неопределено Тогда
				СостояниеПодключения = ПеречСостоянияПодключения.ВнешняяБаза_НеПодключена;			
			КонецЕсли;
			
		КонецЕсли;
		
		Если СостояниеПодключения = ПеречСостоянияПодключения.ВнешняяБаза_НеПодключена 
			ИЛИ НЕ ЗначениеЗаполнено(СостояниеПодключения)
			ИЛИ НЕ ЗначениеЗаполнено(АдресКомОбъекта)
			ИЛИ ВидПодключеннойИБ <> ВидТекущейИБ Тогда
			
			НастройкиИбПоУмолчанию = ВидТекущейИБ.НастройкаПодключенияПоУмолчанию;
			
			// Попытка установки соединения с внешней базой.
			Если ЗначениеЗаполнено(НастройкиИбПоУмолчанию) Тогда
				
				Если ТипСоединения = "КОМ" Тогда
					СоединениеИБ = бит_мпд_ПовтИсп.ПодключитьКОМ(НастройкиИбПоУмолчанию);
				ИначеЕсли ТипСоединения = "ОЛЕ" Тогда
					СоединениеИБ = бит_мпд_ПовтИсп.ПодключитьОЛЕ(НастройкиИбПоУмолчанию);
				КонецЕсли;
				
			Иначе	   
				
				ТекстСообщения = НСтр("ru = 'Для вида информационной базы '") 
								 + Строка(ВидТекущейИБ) 
								 + НСтр("ru = ' не указана настройка подключения по-умолчанию!'");
				ТекстОшибки = ТекстОшибки + Символы.ПС + ТекстСообщения;
				
			КонецЕсли; 
			
		КонецЕсли;	
		
		Если СоединениеИБ = Неопределено Тогда
			
			ТекстСообщения = НСтр("ru = 'Не установлено соединение с внешней базой! Вызов конструктора невозможен.'");
			ТекстОшибки 		 = ТекстОшибки + Символы.ПС + ТекстСообщения;
			СостояниеПодключения = ПеречСостоянияПодключения.ВнешняяБаза_НеПодключена;
			
		Иначе
			
			ВидПодключеннойИБ 	 = ВидТекущейИБ;
			СостояниеПодключения = ПеречСостоянияПодключения.ВнешняяБаза_Подключена;
			
		КонецЕсли; 
		  		
	Иначе
		
		// Текущая база.
		СостояниеПодключения = ПеречСостоянияПодключения.ТекущаяБаза;
		ВидПодключеннойИБ 	 = ВидТекущейИБ;
		
	КонецЕсли;
	
	Возврат СоединениеИБ;

КонецФункции // ПолучитьСоединениеИБ()

// Функция определяет картинку по виду объекта метаданных.
//
// Параметры:
//  ВидОбъекта  – ПеречислениеСсылка.бит_мпд_ВидыОбъектовМетаданных.
//
// Возвращаемое значение:
//   РезКартинка   – Картинка.
//
Функция ОпределитьКартинкуВидаМетаданных(ВидОбъекта) Экспорт

	РезКартинка = Неопределено;
	
	КартинкиОбъектов = Новый Соответствие;
	КартинкиОбъектов.Вставить(Перечисления.бит_мпд_ВидыОбъектовМетаданных.Справочник            ,БиблиотекаКартинок.Справочник);
	КартинкиОбъектов.Вставить(Перечисления.бит_мпд_ВидыОбъектовМетаданных.Документ              ,БиблиотекаКартинок.ДокументОбъект);
	КартинкиОбъектов.Вставить(Перечисления.бит_мпд_ВидыОбъектовМетаданных.ПланВидовХарактеристик,БиблиотекаКартинок.ПланВидовХарактеристик);
	КартинкиОбъектов.Вставить(Перечисления.бит_мпд_ВидыОбъектовМетаданных.ПланСчетов            ,БиблиотекаКартинок.ПланСчетов);
	КартинкиОбъектов.Вставить(Перечисления.бит_мпд_ВидыОбъектовМетаданных.Перечисление    		,БиблиотекаКартинок.Перечисление);
		
	РезКартинка = КартинкиОбъектов[ВидОбъекта];
	
	Возврат РезКартинка;

КонецФункции // ОпределитьКартинкуВидаМетаданных()

// Функция определяет имя значения перечисления во внешней базе.
//
// Параметры:
//   Соединение - ComObject.
//   ПеречислениеКом - ComObject.
//   ЗначениеКом     - ComObject.
//
//
// Возвращаемое значение:
//  ИмяЗначения – Строка.
//
Функция ПолучитьИмяЗначенияПеречисленияВнеш(Соединение, ПеречислениеКом, ЗначениеКом)
	
	ИмяЗначения = "";
	
	ЗначенияПеречисленияМета = ЗначениеКом.Метаданные().ЗначенияПеречисления;
	
	Для каждого ЗначениеМета Из ЗначенияПеречисленияМета Цикл
		
		ТекИмя = ЗначениеМета.Имя;
		ТекЗначениеПеречисления = ПеречислениеКом[ТекИмя];
		
		Если Соединение.String(ЗначениеКом) = Соединение.String(ТекЗначениеПеречисления) Тогда
			
			ИмяЗначения = ТекИмя;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат ИмяЗначения;
	
КонецФункции // ПолучитьИмяЗначенияПеречисленияВнеш()
	
// Функция выполняет перевод имени класса с русского на английский и наооброт.
//
// Параметры:
//   ИмяКласса - строка.
//   ЦелевойЯзык - Строка.
//
// Возвращаемое значение:
//  ИмяКлассаПеревод – Строка.
//
Функция ПеревестиИмяКласса(ИмяКласса, ЦелевойЯзык = "ru") Экспорт

	Словарь = Новый Соответствие;
	Словарь.Вставить("Catalog","Справочник");
	Словарь.Вставить("Document","Документ");
	Словарь.Вставить("Enum","Перечисление");
	Словарь.Вставить("ChartOfAccounts","ПланСчетов");
	Словарь.Вставить("ChartOfCharacteristicTypes","ПланВидовХарактеристик");
	
	Если ЦелевойЯзык = "en" Тогда
	
		Для каждого КиЗ Из Словарь Цикл
		
			Словарь.Вставить(КиЗ.Значение, КиЗ.Ключ);
		
		КонецЦикла; 
	
	КонецЕсли; 

	ИмяКлассаПеревод = Словарь[ИмяКласса];
	
	Если НЕ ЗначениеЗаполнено(ИмяКлассаПеревод) Тогда
	
		ИмяКлассаПеревод = ИмяКласса;
	
	КонецЕсли; 
	
	Возврат ИмяКлассаПеревод;
	
КонецФункции // ПеревестиИмяКласса()

// Функция выполняет перевод имени класса с русского на английский и наооброт.
//
// Параметры:
//   ИмяКласса - строка.
//   ЦелевойЯзык - Строка.
//
// Возвращаемое значение:
//  ИмяКлассаПеревод – Строка.
//
Функция ПеревестиИмяПоля(ИмяПоля, ЦелевойЯзык = "ru") Экспорт

	Словарь = Новый Соответствие;
	Словарь.Вставить("Code","Код");
	Словарь.Вставить("Description","Наименование");
	Словарь.Вставить("DeletionMark","ПометкаУдаления");
	Словарь.Вставить("Parent","Родитель");	
	Словарь.Вставить("Owner","Владелец");		
	Словарь.Вставить("Date","Дата");
	Словарь.Вставить("Number","Номер");
	
	Если ЦелевойЯзык = "en" Тогда
	
		Для каждого КиЗ Из Словарь Цикл
		
			Словарь.Вставить(КиЗ.Значение, КиЗ.Ключ);
		
		КонецЦикла; 
	
	КонецЕсли; 

	Перевод = Словарь[ИмяПоля];
	
	Если НЕ ЗначениеЗаполнено(Перевод) Тогда
	
		Перевод = ИмяПоля;
	
	КонецЕсли; 
	
	Возврат Перевод;
	
КонецФункции // ПеревестиИмяПоля()

// Функция извлекает данные расшифровки из внешней базы HTTP запросом.
//
// Параметры:
//  Расшифровка - Структура.
//
// Возвращаемое значение:
//  ДанныеРасшифровки – Структура.
//
Функция ПолучитьДанныеРасшировкиHTTP(Расшифровка) Экспорт
	
	ДанныеРасшифровки = Новый Структура("ИмяКласса,Выполнено,ОписаниеОшибки,Объект", "ДанныеРасшифровываемогоОбъекта", Ложь,"", Новый Структура());
	
	// Формируем текст HTTP запроса для извлечения расшифровываемого объекта.
	Имена = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(Расшифровка.ПолноеИмя);
	
	ТекстЗапроса = бит_мпд_КлиентСервер.ПризнакОбращенияОДата()+"%ИмяКлассаАнгл%_%ИмяОбъекта%(guid'%ИД%')";
	
	ИмяКлассаАнгл = ПеревестиИмяКласса(Имена.ИмяКласса,"en");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ИмяКлассаАнгл%", ИмяКлассаАнгл);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ИмяОбъекта%"   , Имена.ИмяОбъекта);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ИД%"           , Расшифровка.ИД);
	
	// Выполняем HTTP запрос.
	НастройкаПодключения = Расшифровка.НастройкаПодключения;
	Путь = НастройкаПодключения.ИмяСервера+"/"+НастройкаПодключения.ИмяБазы;	
	
	СоединениеHTTP = Новый HTTPСоединение(Путь,,НастройкаПодключения.Пользователь,НастройкаПодключения.Пароль);
	ЗапросHTTP = Новый HTTPЗапрос(ТекстЗапроса);
	ОтветHTTP = СоединениеHTTP.Получить(ЗапросHTTP);
	
	ТекЭлемент = Неопределено;
	Если ОтветHTTP.КодСостояния = 200 Тогда
		
		// Разбираем информацию.
		СтрОтвет = ОтветHTTP.ПолучитьТелоКакСтроку();
		
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(СтрОтвет);
		
		Пока Чтение.Прочитать() Цикл
			
			
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента 
				И Чтение.Имя = "m:properties" Тогда
				
				ТекЭлемент = Новый Структура;
				
			КонецЕсли; 
			
			Если НЕ ТекЭлемент = Неопределено Тогда
				
				Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента 
					И Найти(Чтение.Имя, "d:")>0 Тогда
					
					ИмяПоля = СтрЗаменить(Чтение.Имя, "d:","");
					Если ВРег(ИмяПоля) = ВРег("Ref_Key") Тогда
						
						ИмяПоля = "ИД";	
						
					ИначеЕсли Найти(ИмяПоля, "_Key") > 0 
						      ИЛИ Найти(ИмяПоля, "_Type") > 0 Тогда
						
						// Не выводим ИД ссылок в расшифровку.
						флУстановитьЗначение = Ложь;
						Продолжить;
						
					КонецЕсли; 
					флУстановитьЗначение = Истина;
					
				КонецЕсли; 
				
				Если Чтение.ТипУзла = ТипУзлаXML.Текст 
					И флУстановитьЗначение 
					И ЗначениеЗаполнено(ИмяПоля)  Тогда
					
					ИмяПоля = ПеревестиИмяПоля(ИмяПоля,"ru");
					ТекЗначение = Чтение.Значение;
					Если ВРег(ТекЗначение) = ВРег("false") Тогда
					
						ТекЗначение = Истина;
						
					ИначеЕсли Врег(ТекЗначение) = ВРег("true") Тогда
						
						ТекЗначение = Ложь;
					
					КонецЕсли; 
					ТекЭлемент.Вставить(ИмяПоля, ТекЗначение);
					флУстановитьЗначение = Ложь;
					
				КонецЕсли;
				
				Если Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента 
					И Чтение.Имя = "m:properties" Тогда
					
					ДанныеРасшифровки.Объект = ТекЭлемент;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	Иначе	
		
		ДанныеРасшифровки.ОписаниеОшибки =  НСтр("ru = 'Не удалось выполнить расшифровку.  Код ошибки: %1%.'");
		ДанныеРасшифровки.ОписаниеОшибки = бит_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыСтроки(ДанныеРасшифровки.ОписаниеОшибки, ОтветHTTP.КодСостояния); 
		
	КонецЕсли; 
	
	Возврат ДанныеРасшифровки;
	
КонецФункции // ПолучитьДанныеРасшировкиHTTP()

#КонецОбласти
